Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ཀྱི་གཡོན་ཕྱོགས་སེང་གེའི་ཁྲིའི་འོག་ཏུ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཞབས་དྲུང་དང་ཉེ་བ་དེར།
en: “To the left of the Blessed One, below his lion throne, and near to the soles of the noble Avalokiteśvara’s feet,

source: རིན་པོ་ཆེའི་རི་བོའི་སྟེང་དུ་ལྷ་མོ་སྒྲོལ་མ་སྔར་ཅི་ལྟར་བསྟན་པ་དེ་བཞིན་དུ་བྲི་བར་བྱ་སྟེ
en: the Goddess Tārā should be painted sitting on that jewel mountain. She should be depicted exactly as previously described.

source: རས་རིས་དེའི་ཁོ་ར་ཁོར་ཡུག་ཏུ་མེ་ཏོག་གཏོར་བ་བྲི་བར་བྱས་ལ་གཅལ་བཀྲམ་པར་བྱ་བ་ལ་མེ་ཏོག་ཙམ་པ་ཀ་དང་ནཱི་ལོད་པ་ལ་པདྨ་དང་དྲི་མཆོག་དང་མཱ་ལ་ཏི་དང་། བཱར་ཤི་ཀ་དང་དྷཱ་ནུ་ཥྐཱ་རི་ཀ་དང་པུན་ནཱ་ག་དང་། ནཱ་ག་གེ་སར་ལ་སོགས་པའི་མེ་ཏོག་གིས་རས་རིས་དེ་ལ་ཁོ་ར་ཁོར་ཡུག་ཏུ་གཏོར་བར་བྱའོ། །
en: The canvas should be strewn all over with flowers, such as champak, fragrant blue lotus, royal jasmine, Arabian jasmine, dhānuṣkārīka jasmine, and blossoms of the pannay tree, ironwood tree, and so forth. {5.10}

source: རས་རིས་ཀྱི་སྟེང་གི་མཐའི་ཟུར་གཉིས་སུ་ལྷའི་བུ་གཉིས་མེ་ཏོག་གི་ཚོགས་འཐོར་བ།
en: “And above, in the upper two corners, two gods should be painted releasing a great flood of flowers.

source: གཟུགས་རྣམ་པར་བཀྲ་བ་བར་སྣང་ལ་གནས་པ། ཆར་འབྱིན་པའི་སྤྲིན་གྱི་ནང་ནས་
en: They each have variegated, bright forms and rest within rain clouds in the midst of space.

source: མགོ་ཙམ་འཐོན་པ་ལྡིང་བཞིན་པ། ཁ་དོག་དཀར་པོ་བྲི་བར་བྱའོ། །
en: They should be depicted as white and flying. {5.11}

source: རས་རིས་འབྲིང་དུ་གསུངས་པ་འདི། །དཔལ་དོན་གཉེར་ལ་ཡང་དག་འབྱུང་། །
en: “This painting, which is called ‘medium,’ Is produced for the sake of good fortune.

source: ས་ཡི་སྟེང་གི་མི་རྣམས་ལ། །གྲུབ་པ་འབྲིང་ནི་འདི་ལ་བརྟེན། །
en: For people here on earth It brings middling accomplishments. {5.12}

source: འཁོར་བར་སྔོན་ཆད་འཁོར་བ་ན། །སྡིག་པ་ཅུང་ཟད་གང་བྱས་པ། །འདིར་ནི་རས་རིས་མཐོང་ཙམ་གྱིས། །དེ་ཡི་མོད་ལ་རྣམ་པར་འཇིག །
en: “Any bad karma previously accumulated By one wandering in saṃsāra Will be destroyed instantly Through merely seeing this painting in this life. {5.13}

source: འགྲོ་བ་ལྔར་ནི་འཁོར་བ་ན། །སེམས་ཅན་རྨོངས་པས་མི་ཤེས་ཏེ། །
en: “Circling throughout the five destinies, Deluded people do not know this.

source: འཇམ་པའི་དབྱངས་ཀྱི་རས་རིས་ནི། །འབྲིང་པོ་མཐོང་བར་མི་བྱེད་པའོ། །
en: Those, however, who have seen This painting of Mañjughoṣa in its medium version, {5.14}

source: མཚམས་མེད་ལྔ་པོ་བྱེད་པ་དང་། །སྡིག་པའི་རྙོག་པ་བྱེད་གྱུར་པ། །སྔགས་རྣམས་སྣ་ཚོགས་གསུངས་གྱུར་པས། །ཚུལ་ཁྲིམས་ཉམས་པའང་འགྲུབ་པར་འགྱུར། །
en: “Even if they commit offenses Such as the five acts of immediate retribution, Even if they lack morality, they will succeed At the various mantras that have been taught. {5.15}

source: མྱུར་དུ་རྟོགས་པའང་འགྲུབ་པ་ནི། །བཟླས་པས་ཐོབ་པར་བྱེད་པ་ཡིན། །
en: “Having done their recitation They will swiftly gain accomplishment.

source: རས་རིས་འབྲིང་པོ་མཐོང་བས་ནི། །ནད་པ་དག་ཀྱང་ནད་ལས་ཐར། །
en: The sick will be freed from their illness, The poor will obtain wealth,

source: དབུལ་པོ་དག་ཀྱང་ནོར་ཐོབ་བྱེད། །བུད་མེད་རྣམས་ཀྱང་བུ་འཐོབ་འགྱུར། །
en: The childless will obtain sons When they behold the medium painting. {5.16}

source: དེ་ཚེ་མཐོང་བ་ཙམ་གྱིས་ནི། །བསོད་ནམས་རྒྱ་ཆེན་ཐོབ་པར་འགྱུར། །
en: “As soon as they see it, They will obtain merit great and vast.

source: ངེས་པར་ལྷ་དང་མི་རྣམས་ཀྱི། །བདེ་བ་མི་ཡིས་བསྟེན་པར་འགྱུར། །
en: Such a person will certainly come to partake In the happiness of gods and humans

source: སྐྱེ་བ་གཞན་དུ་ངེས་པར་ནི། །སངས་རྒྱས་ཉིད་ནི་ངེས་ཐོབ་འགྱུར། །
en: And will definitely attain buddhahood At the end of this birth. {5.17}

source: ཀློག་དང་འདྲི་བ་ཉིད་དང་ནི། །དེ་བཞིན་མཆོད་དང་ཕྱག་འཚལ་དང་། །
en: “Through merely drawing or describing it, Likewise through worshiping it, making copies of it,

source: མཐོང་དང་རེག་པ་ཙམ་གྱིས་ནི། །སྡིག་པའི་རྙོག་པ་ཀུན་ལས་གྲོལ། །
en: Viewing it, or touching it, One will be freed from all negativity. {5.18}

source: རས་རིས་འདི་ནི་མཐུ་ཆེན་ལ། །དོན་དུ་གཉེར་དང་བསྐུལ་བས་ནི། །མྱུར་དུ་སྐྱེ་བ་དོན་ཡོད་འཐོབ། །རྗེས་སུ་ཡི་རང་དེ་བཞིན་ནོ། །
en: “So also, through requesting this painting of great splendor, Or requesting the instructions thereof, One will obtain a fruitful life And swiftly win happiness. {5.19}

source: རས་རིས་མཐོང་བའི་སྐྱེ་བོ་ཡི། །བསོད་ནམས་ཐོབ་པ་དོན་ཡོད་པ། །བསྐལ་པ་བྱེ་བ་རྣམས་སུ་ཡང་། །བརྗོད་པར་ཡང་ནི་མི་ནུས་སོ། །
en: “It is not possible to express in words, Not even in millions of infinite eons, The merit and its results one would obtain Through merely seeing this painting.” {5.20}

source: བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཕལ་པོ་ཆེ་ཐེག་པ་ཆེན་པོ་རྒྱ་ཆེ་བའི་མདོ་ལས། འཕགས་པ་འཇམ་དཔལ་གྱི་རྩ་བའི་ཆོ་ག་ཞིབ་མོ་ལེའུ་ལྔ་པའི་ཆོ་ག་རབ་འབྱམ་ལས་རས་རིས་གཉིས་པའི་ཆོ་ག་རྫོགས་སོ།། །།
en: This concludes the detailed fifth chapter, the second in the detailed section on the procedure of cloth painting, from “The Root Manual of Noble Mañjuśrī,” an extensive Mahāyāna sūtra that forms a garland-like basket of bodhisattva teachings.

source: དེ་ནས་གཞན་ཡང་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ།
en: Now, Lord Śākyamuni again addressed Mañjuśrī, the divine youth:

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་གཞན་ཡང་ཁྱོད་ཀྱིས་རས་རིས་གསུམ་པའི་ཆོ་ག་རབ་ཏུ་གསུངས་པ་ཞེས་བྱ་བ་ཡོད་དེ
en: “There is, Mañjuśrī, yet another secret cloth-painting procedure, a third type, referred to as ‘smallest,’

source: གང་སེམས་ཅན་རྣམས་ལ་འབད་པ་མེད་པར་འགྲུབ་པར་འགྱུར་བ་སྔར་བསྟན་པའི་བཟོ་བོ་དང་། ཆོ་ག་དང་བདེ་བར་གཤེགས་པའི་མཐོ་གང་ཙམ་ཐད་ཀར་དེ་བཞིན་དུ་ཀུན་ནས་ཟུར་བཞི་སྔ་མ་བཞིན་དུ་རས་ལ་རི་མོ་བྱའོ། །
en: by the means of which all beings can effortlessly win accomplishment. {6.1} “Following the procedures as previously described, skilled craftsmen should prepare a cloth one width of the Buddha’s hand across that is in the same four-sided shape as before.

source: སྔར་བསྟན་པའི་ཚོན་གྱིས་དང་པོར་རེ་ཞིག་འཕགས་པ་འཇམ་དཔལ་སེང་གེའི་ཁྲི་ལ་བཞུགས་པ་སྔ་མ་བཞིན་དུ་བྱིས་པ་ཁྱེའུའི་གཟུགས་མཛེས་པའི་གཟུགས་ཅན་འོད་ཟེར་འཕྲོ་བ་དང་ལྡན་པ་ཆོས་འཆད་པ་བྲི་བར་བྱའོ། །
en: The painting should then be done with the paints as previously described. {6.2} “First one should paint Noble Mañjuśrī, sitting on a lion throne with the form, as before, of a young boy expounding the Dharma. He should be painted as having a charming form that radiates light.

source: གཡོན་གྱི་ཕྱོགས་སུ་འཕགས་པ་ཀུན་དུ་བཟང་པོ་རིན་པོ་ཆེའི་རི་ལ་གནས་པ།
en: To his left, the noble Samantabhadra stands on a dais of precious stone,

source: རྔ་ཡབ་ལག་ན་ཐོགས་པ་ལག་པ་གཡོན་པ་ན་ནོར་བུ་རིན་པོ་ཆེ་ཐོགས་པ།
en: with his right hand extended forth holding a yak-tail whisk and his left hand holding a wish-fulfilling gem.

source: མེ་ཏོག་པྲི་ཡང་ཀུ་ལྟར་སྔོ་སངས་སྔ་མ་བཞིན་དུ་བྲི་བར་བྱའོ། །
en: As before, he should be painted in the dark blue color of the beautyberry flower.

source: འཕགས་པ་འཇམ་དཔལ་གྱི་གཡས་ཕྱོགས་སུ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་སྔ་མ་བཞིན་རིན་པོ་ཆེའི་རི་ལ་གནས་པ།
en: To the right of Noble Mañjuśrī stands the noble Avalokiteśvara on a dais of precious stone.

source: རྔ་ཡབ་ལག་ན་ཐོགས་པ་ལག་པ་གཡོན་པ་ན་པདྨ་འཛིན་པ།
en: As before, he has a yak-tail whisk in his [right] hand and a lotus in his left.

source: ལུས་ཀུན་ནས་འོད་དང་ལྡན་པ་བྲི་བར་བྱའོ། །
en: He should be drawn with his form haloed in blazing light. {6.3}

source: སེང་གེའི་ཁྲིའི་འོག་ཏུ་རིན་པོ་ཆེའི་རས་རིས་ཀྱི་མཐའི་བར་དུ་བྲི་བར་བྱའོ། །
en: “Below Mañjuśrī’s lion throne should be painted a golden-colored mountain, extending down to the edge of the canvas.

source: རས་ཀྱི་མཐའ་མ་དང་ཉེ་བའི་ཟུར་དུ་འཕགས་པ་འཇམ་དཔལ་གྱི་སེང་གེའི་ཁྲིའི་འོག་གཡས་ཕྱོགས་སུ་ཁྲོ་བོའི་རྒྱལ་པོ་གཤིན་རྗེ་གཤེད་སྔ་མ་བཞིན་དུ་བྲི་བར་བྱའོ། །
en: In the corner at the edge of the canvas, below the lion throne of Noble Mañjuśrī and to his right, Yamāntaka, the Lord of Wrath , should be painted with the same details as before.

source: དེའི་འོག་ཏུ་སྒྲུབ་པ་པོ་སྔ་མ་བཞིན་དུ་བྲི་བར་བྱ་སྟེ། སྤོས་སྣོད་ལག་ན་ཐོགས་པ་ཐམས་ཅད་ཀྱང་སྔ་མ་ཇི་ལྟ་བ་བཞིན་དུ་བྱའོ། །
en: The practitioner should be painted as before, holding an incense holder. {6.4}

source: འཕགས་པ་འཇམ་དཔལ་གྱི་སྟེང་དུ་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་ཡང་དག་པར་སྐྱེས་པའི་དབང་པོའི་རྒྱལ་པོ་བྲི་བར་བྱ་སྟེ། རིན་པོ་ཆེའི་རིའི་ཕུག་སོར་བཅུ་དྲུག་གི་ཚད་ཙམ་གྱི་ནང་ན་བཞུགས་པ།
en: “Above Noble Mañjuśrī should be painted Tathāgata Saṃkusumita­rājendra, sixteen fingers tall, sheltering in a cave on a jeweled mountain.

source: རིའི་སྟོད་ཀྱི་ཆ་ཁང་པ་བརྩེགས་པ་འདྲ་བ་བྲི་བར་བྱའོ། །
en: Its ten peaks should be drawn to resemble palaces.

source: རས་རིས་ཀྱི་ཁོ་ར་ཁོར་ཡུག་ཏུ་རིའི་རྣམ་པས་ཡོངས་སུ་འཁོར་བ་བྲི་བར་བྱའོ། །
en: Around the perimeter of the cloth one should draw a ring of mountains.

source: སྟེང་གི་རས་ཀྱི་མཐའ་གཉིས་ལ་གནས་པའི་རིའི་སྟོད་ཀྱི་ཆ་ལ་ལྡིང་བ་བཞིན་དུ་མེ་ཏོག་གི་ཚོགས་འཐོར་བའི་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་དག་པ་དང་རྣམ་པར་དག་པ་ཞེས་བྱ་བ་གཉིས་སྔ་མ་བཞིན་དུ་བྲི་བར་བྱ་ཞིང་། །
en: Above, perched on the front slopes of the mountains located in the two upper corners of the cloth, are two divine sons from the realm of the Pure Abode, named Śuddha and Viśuddha, who scatter heaps of flowers that float in arrays. They should be painted [with the same details] as before.

source: རས་ལ་མེ་ཏོག་རྣམ་པ་སྣ་ཚོགས་ཀྱི་གཅལ་བཀྲམ་པ་ཡང་བྲི་བར་བྱའོ། །
en: The painting should be drawn with various flowers placed all around it. {6.5}

source: རྣམ་གསུམ་རས་རིས་མཚན་ཉིད་ནི། །ཐམས་ཅད་འདིར་ནི་བསྟན་པ་ལས། །
en: “The entire threefold description Has now been given.

source: འདི་ནི་ཐ་མ་ཞེས་བྱ་སྟེ། །ཕྲན་ཚེགས་ལས་རྣམས་དག་ལ་ཤེས། །
en: The painting called ‘smallest’ Is the best for minor rites. {6.6}

source: བསྐལ་པ་བྱེ་བར་མི་བཟད་ལས། །རས་རིས་མཐོང་བ་ཙམ་གྱིས་གྲོལ། །
en: “Whatever evil has been committed or caused to be committed, All this terrible karma, Accumulated over thousands of eons, Will be purified through merely seeing this painting. {6.7}

source: རས་རིས་མཐོང་བ་ཙམ་གྱིས་ནི། །སྐད་ཅིག་དེ་ལ་གྲོལ་བར་འགྱུར། །
en: “As soon as this painting is seen, At that very moment the karma will be purified.

source: སངས་རྒྱས་བྱེ་བ་སྟོང་ཕྲག་ནི། །མཐོང་བ་ཙམ་གྱིས་གྲོལ་འགྱུར་ཏེ། །རས་རིས་མཐོང་བ་ཙམ་གྱིས་ཀྱང་། །དེ་ཡི་མོད་ལ་གྲོལ་བར་འགྱུར། །སངས་རྒྱས་བྱེ་བ་སྟོང་ཕྲག་ལ། །བློ་དང་ལྡན་པས་བསྙེན་བཀུར་བས། །རས་རིས་ཐ་མ་མཐོང་བ་ནི། །བཅུ་དྲུག་ཆར་ཡང་མི་ཕོད་དོ། །
en: A wise person who paid respects To thousands of millions of buddhas “Will not obtain even one sixteenth of the merit Obtained through merely seeing this smallest painting. {6.8}

source: སངས་རྒྱས་སྐྱོབ་པ་ཀུན་ལ་ནི། །མཆོད་བྱས་བསོད་ནམས་གང་ཡིན་པ། །མཁས་པས་བསོད་ནམས་གང་ཐོབ་དེ། །རས་རིས་མཐའ་མ་མཐོང་བའི་ཡིན། །
en: “A wise man will obtain the same merit By merely looking at this smallest painting As he would obtain by worshiping All the protector buddhas.

source: དགེ་བ་དག་གི་ལས་རྣམས་ལ། །ལོངས་སྤྱོད་ཕྱིར་ཡང་འདིར་སྤྱད་དོ། །
en: In this life he will thus perform Meritorious acts leading to good fortune. {6.9}

source: སྔགས་རྣམས་གང་དག་ཅི་ཡོད་པ། །ཚངས་དབང་དྲང་སྲོང་གིས་བཤད་དང་། །ནམ་མཁའ་ལྡིང་གིས་གང་བཤད་དང་། །ཆུ་ལྷ་ཉི་མ་ལུས་ངན་དང་། །ནོར་སྦྱིན་སོགས་དང་སྲིན་པོ་དང་། །ལྷ་མིན་དབང་པོ་ལྟོ་འཕྱེ་དང་། །ཟླ་བ་རླུང་དང་གཤིན་རྗེ་སོགས། །ཁྱབ་འཇུག་ལྷ་ཆེན་སོགས་བཤད་པ། །སྔགས་རྣམས་འདིར་ནི་བཀུག་པ་དག །རས་རིས་མདུན་དུ་དངོས་གྲུབ་འགྱུར། །
en: “However many mantras Have been taught by the sages Brahmā and Indra; By Vainateya, Varuṇa, Āditya, or Kubera; {6.10} “By all the rākṣasas, Dhanada and so forth; By the lordly dānavas or mahoragas; By Soma, Vāyu, Yama, and so forth— Any that have been taught by Viṣṇu or Śiva— All these mantras brought here before this painting Would be accomplished. {6.11}

source: འདིར་ནི་ཞི་བ་བྱ་བ་སྟེ། །དེ་བཞིན་དུ་ནི་རྒྱས་པ་བྱ། །
en: “One should always perform pacifying And enriching rites in this way.

source: འདིར་ནི་མངོན་སྤྱོད་སྤང་བྱ་སྟེ། །ཐུབ་པ་མཆོག་གིས་སྨད་པ་ཡིན། །
en: Violent acts ought to be shunned, As they have been condemned by the best of victors.” {6.12}

source: བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཕལ་པོ་ཆེ་ཐེག་པ་ཆེན་པོའི་མདོ་སྡེ་ཤིན་ཏུ་རྒྱས་པ་ལས། འཇམ་དཔལ་གྱི་རྩ་བའི་ཆོ་ག་ཞིབ་མོ་ལེའུ་དྲུག་པའི་ཆོ་ག་རབ་འབྱམ་ལས། རས་རིས་ཆུང་ངུ་གསུམ་པའི་ཆོ་ག་རྫོགས་སོ།། །།
en: This concludes the detailed sixth chapter in “The Root Manual of Mañjuśrī,” an extensive Mahāyāna sūtra that forms a garland-like basket of bodhisattva teachings. This chapter contains the third procedure, that of the “smallest” painting.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་ནས། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: circumambulated Lord Śākyamuni three times clockwise and, having prostrated at his feet, said this to the Blessed One:

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ནི་ལེགས་སོ་ལེགས་སོ། །
en: “Good! It is good that you, the blessed one, the tathāgata, the worthy one, the perfectly awakened one, gave this Dharma discourse in such a clear way

source: རིག་པ་ཐམས་ཅད་ཀྱི་བརྟུལ་ཞུགས་སྤྱད་པའི་དོན་དང་། ཕན་པ་དང་བདེ་བ་དང་འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་དང་།
en: for the benefit, the welfare, and the happiness of all who observe their vidyā vows and in order to show your compassion for the world.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐབས་ལ་མཁས་པ་སྟོན་པ། ཕུང་པོ་ལྷག་མ་དང་བཅས་པའི་མྱ་ངན་ལས་འདས་པའི་གྲོང་ཁྱེར་དུ་འགྲོ་བར་བྱེད་པ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྒྱུད་ངེས་པར་བྱང་ཆུབ་སྒྲུབ་པར་བྱེད་པ། སྔགས་ཀྱི་སྤྱོད་པ་ཐམས་ཅད་ཀྱི་དོན་སྒྲུབ་པར་བྱེད་པ།
en: You exemplified the bodhisattvas’ skill in means with this particular method that takes them higher than nirvāṇa and, with their continuous dedication to the goal of awakening, accomplishes their conduct consistent with all the goals of the mantras.

source: བདག་གི་གསང་སྔགས་འདི་སྐྱེ་བོ་ཐམས་ཅད་ལ་རྒྱས་པར་བྱེད་པར་འགྱུར་རོ། །
en: This will promote the spread of this secret mantra among all people. {7.1}

source: མ་འོངས་པའི་དུས་ན་འཇིག་རྟེན་གྱི་བླ་མ་འདས་པ་ན། དེ་བཞིན་གཤེགས་པའི་ཉི་མའི་རིགས་ནུབ་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སྤངས་པ་དང་། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་། འཕགས་པ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ཀྱིས་མུན་པར་གྱུར་པ་དང་། སྣོད་ཀྱི་འཇིག་རྟེན་རྣམ་པར་འཇིག་པ་དང་
en: “In the future, when the teachers of the world have entered nirvāṇa and the sun of the tathāgatas has set—when their lineages have ended and all the buddhafields are empty of all the buddhas, bodhisattvas, noble śrāvakas, and pratyeka­buddhas; when the inhabitants of the world have become blind with ignorance;

source: འཕགས་པའི་ལམ་དང་། རིག་པ་ཐམས་ཅད་དང་སྔགས་དང་སྨན་དང་། ནོར་བུ་རིན་པོ་ཆེ་མེད་པ་དང་། སྐྱེ་བོ་དམ་པ་རྣམས་ཀྱིས་འཇིག་རྟེན་ན་ཡོངས་སུ་མ་ཟིན་པ་དང་། སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་འབྱུང་བར་འགྱུར་ཏེ
en: when the noble eightfold path has been cut and the medicine of all the vidyā mantras that are like precious gems is lost; when the world spheres have gone dark, devoid of good people —

source: ལེ་ལོ་ཅན་དང་དྲན་པ་ཉམས་པ་དང་། མ་དད་པ་དང་མི་སྲུན་པ་དང་མི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་ཟིན་པ་དང་
en: at that time, beings will be lazy because of lack of interest; they will lack faith, will be willfully destructive, and will not rely on spiritual friends.

source: གཡོ་སྒྱུ་དང་ལྡན་པ་དང་། སླུ་བ་སྤྱོད་པ་དེ་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་སྐྲག་པར་འགྱུར་ཏེ
en: They will be deceitful and treacherous, and they will act like rogues. {7.2} “Such people, when hearing this Dharma discourse, will become frightened.

source: ལེ་ལོ་ལ་མངོན་པར་འདོད་ཅིང་དད་པར་མི་འགྱུར་ལ།
en: Indulging in idleness and apathy, they will lack faith.

source: འདོད་པ་ཚོལ་ཞིང་ཡིད་ཆེས་པར་མི་འགྱུར་རོ། །
en: Seeking sensual enjoyments, they will lack conviction.

source: ལོག་པའི་ལྟ་བ་སྐྱེ་ཞིང་བསོད་ནམས་མ་ཡིན་པ་འཕེལ་བར་འགྱུར་རོ། །
en: Delighting in wrong views, they will generate a lot of negativity.

source: མཚམས་མེད་པར་གཞོལ་ཞིང་ཤིན་ཏུ་མི་བཟད་པའི་ཡང་ཤིན་ཏུ་མི་བཟད་པ་འཐོབ་པ་སྡུག་བསྔལ་བ་དེ་དག་གི་དོན་དང་དབང་མེད་པ་ལ་དབང་དུ་བྱ་བའི་དོན་དང་།
en: Rejecting the true Dharma, they will move from one terrible state to one even worse, bound for Avīci Hell. For the sake of those suffering like this, to enthrall the unsubmissive and,

source: དབང་དུ་གྱུར་པ་ལ་མི་འཇིགས་པ་སྦྱིན་པའི་ཕྱིར་དང་། ཐབས་མཁས་པས་བསྡུ་བའི་སྦྱོར་བ།
en: once they are enthralled, to grant them fearlessness, please muster your skill in means,

source: སྔགས་ཀྱི་རས་ཀྱི་རི་མོའི་ཆོ་ག་གང་དེའི་དུས་ལ་བབ་པར་མཁྱེན་ན་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: O Blessed One, and teach them the procedure of painting involving mantras if you think that the time is right.” {7.3}

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: Then Lord Śākyamuni applauded Mañjuśrī, the divine youth:

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་འདྲི་བར་སེམས་པ་ལེགས་སོ་ལེགས་སོ། །
en: “Good, Mañjuśrī! It is good that you ask the Tathāgata about this matter.

source: འཇམ་དཔལ་ཁྱོད་ཀྱི་མཆོག་ཏུ་གསང་བ་རིག་པའི་བརྟུལ་ཞུགས་སྤྱོད་པའི་ལེའུ་རས་རིས་ཀྱི་ཆོ་ག་རབ་འབྱམ་ཡོད་དེ།
en: There is, Mañjuśrī, your most secret and detailed teaching on another procedure of cloth painting, with its associated conduct and practice of the vidyā observances.

source: སྙིང་པོ་མཆོག་རྣམས་ཀྱི་དོན་མཆོག་ཏུ་གསང་བ་དམ་པ་དོན་ཆེན་པོ་སྔགས་ཐམས་ཅད་ཀྱི་ཆོ་གར་གྱུར་པ་དྲུག་པོ་འདི་དག་ཡི་གེ་དྲུག་གི་སྙིང་པོའི་མཆོག །ཐེ་ཚོམ་མེད་པ་དེའི་ཚེ་འགྲུབ་པར་འགྱུར་ཏེ
en: It includes the supreme and most secret meaning of the mantras of the ultimate essence—the great meaning that is the foundation of all mantras. {7.4} “These six six-syllable mantras of the ultimate essence will, at that time, lead to an accomplishment without a doubt.

source: སེམས་ཅན་དེ་དག་གདུལ་བའི་ཕྱིར་དང་། ཐབས་ལ་མཁས་པ་ལ་ཡང་དག་པར་རབ་ཏུ་ཞུགས་པའི་ཕྱིར་དང་། ངེས་པར་ཡང་དག་པའི་བྱང་ཆུབ་ཐོབ་པའི་ཕྱིར། སངས་རྒྱས་བྱེ་བ་ཕྲག་བདུན་ཅུ་རྩ་དྲུག་གིས་སྔར་གསུངས་ཤིང་ད་ལྟར་ཡང་ངས་བཤད་དེ
en: I too will now teach what was previously taught by seven hundred and sixty million buddhas in order to tame such beings, to help them develop the skill in means, to cause them to take up the practice of the mantra, and to invariably bring them to perfect awakening.

source: མ་འོངས་པའི་སྐྱེ་བོའི་ཚོགས་ལ་ཕན་པའི་ཕྱིར་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་། ངས་བཤད་པར་བྱའོ། །
en: Focusing on the people of the future, listen well and reflect on the meaning thoroughly.

source: དེ་གང་ཞེ་ན།
en: I will now tell you, so what are they?” {7.5}

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་སྔགས་གསུངས་པ།
en: Lord Śākyamuni then pronounced the mantras:

source: ཨོཾ་བཱཀྱེ་྅རྠ་ཛ་ཡ།
en: “ Oṁ vākyārthe jaya.

source: ཨོཾ་བཱཀྱེ་ཤེ་ཤ་སྭཱ།
en: “ Oṁ vākyaśeṣe sva.

source: ཨོཾ་བཱཀྱེ་བཾ་ཛ་ཡ།
en: “ Oṁ vākyeyanayaḥ.

source: ཨོཾ་བཱཀྱེ་ནི་ཥྠེ་ཡ།
en: “ Oṁ vākyaniṣṭheyaḥ.

source: ཨོཾ་བཱཀྱེ་ཡ་ན་མཿ།
en: “ Oṁ vākyeya namaḥ.

source: ཨོཾ་བཱཀྱེ་དཾ་ན་མཿ།
en: “ Oṁ vākyeda namaḥ. {7.6}

source: དེ་ལྟར་འདི་དག་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཁྱོད་ཀྱི་སྔགས་དྲུག་དང་ཡི་གེ་དྲུག་པ་མཐུ་ཆེན་པོ་དང་སྟོབས་མཉམ་པ།
en: “These six mantras of yours, Mañjuśrī, each numbering six syllables, are of great power and equal in their great potency.

source: སྙིང་པོ་དམ་པ་མཆོག་ཏུ་གྲུབ་པ། སངས་རྒྱས་བཞིན་དུ་འབྱུང་བ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་གྱི་ཕྱིར། སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་རབ་ཏུ་གསུངས་པ།
en: They are the supreme heart mantras that bring the highest accomplishment, as if they originated from the Buddha himself. They have been proclaimed by every buddha for the benefit of all beings.

source: དམ་ཚིག་ཉམས་པ་དང་དམ་ཚིག་གཡོས་པ་རྣམས་ཀྱི་ལས་ཐམས་ཅད་བྱེད་པ།
en: They involve and activate the samaya and are suitable for all types of activity.

source: བྱང་ཆུབ་ཀྱི་ལམ་རྗེས་སུ་སྟོན་པ། དེ་བཞིན་གཤེགས་པའི་རིགས་ལ་སྔགས་ཀྱི་མཆོག་ཏུ་གྱུར་པ།
en: They are signposts for the road to awakening and are the most important mantras of the Tathāgata family .

source: མཆོག་དང་འབྲིང་དང་ཐ་མ་གསུམ་ལ་རབ་ཏུ་སྦྱོར་བ།
en: They can be employed in all three levels of ritual, the highest, the medium, and the lowest.

source: ལེགས་པར་སྦྱངས་པའི་ལས་ཀྱི་འབྲས་བུའི་རྣམ་པར་སྨིན་པ་སྦྱིན་པ།
en: They bring the ripening of the fruit of virtuous karma.

source: བསྟན་པ་ནུབ་པའི་དུས་སུ་ཡང་དངོས་གྲུབ་ཐོབ་པར་འགྱུར་རོ། །
en: They will lead to accomplishment at the time when the Buddha’s teaching has disappeared. {7.7}

source: ལས་ཀྱི་ཚུལ་དང་བཅས་པ་ལ་ཡང་དག་པར་གཞོལ་བ་ལ། སྐད་ཅིག་གིས་དོན་བསྒྲུབ་པར་འགྱུར་བ་དེ་དག་མྱུར་དུ་ཤིན་ཏུ་མྱུར་བར་དེའི་ཚེ་དང་དེའི་དུས་སུ་འགྲུབ་པར་འགྱུར་རོ། །
en: “For those who will have succeeded in finding, for the sake of protection, a true Dharma guide, these mantras will, even through only basic application, accomplish the goals of kingship, good fortune, and great powers. They will swiftly lead them to accomplishment at that time and juncture.

source: ཉམ་སད་པའི་ཕྱིར་ཡང་སྙིང་པོ་དམ་པ་འདི་དག་བསྒྲུབ་པར་བྱ་སྟེ།
en: Therefore, these supreme heart mantras should be accomplished even if it were only out of curiosity.

source: མདོར་ན་ཇི་ལྟ་ཇི་ལྟར་རབ་ཏུ་སྦྱར་བ་དེ་ལྟ་དེ་ལྟར་འགྲུབ་པར་འགྱུར་རོ། །
en: In short, in whatever way they are employed, they will lead to corresponding accomplishments.

source: དེས་ན་རས་རིས་ཀྱི་ཆོ་ག་འདི་བྱ་བ་ཡིན་ཏེ།
en: The painting procedure involving these mantras will now be presented in brief. {7.8}

source: དེའི་ཚེ་དེའི་དུས་ན་འཇིགས་པ་ཆེན་པོ་དང་། སྙིགས་མ་ལ་སེམས་ཅན་བསོད་ནམས་ཆུང་བ་འབྱུང་བར་འགྱུར་ཏེ།
en: “At that time, during the terrible period of five degenerations, beings will have very little merit.

source: གྲགས་པ་ཆུང་བ་དང་། ཚེ་ཐུང་བ་དང་ལོངས་སྤྱོད་ཆུང་བ་དང་།
en: They will be petty, with short lifespans and little happiness.

source: ཆོས་སྤྱོད་པ་ཆུང་བས་ཤིན་ཏུ་རྒྱ་ཆེ་བའི་རས་རིས་ཀྱི་ཆོ་གའི་སྒྲུབ་པ་ལ་སོགས་པ་རྩོམ་པར་མི་ནུས་ཏེ།
en: Being weak in diligence, they will not even be able to begin the very elaborate rites for the painting procedures.

source: དེ་དག་གི་ཕྱིར་ཤིན་ཏུ་མདོར་བསྟན་པར་བྱའོ། །
en: It is for their benefit that I will teach a very short procedure. {7.9}

source: དང་པོར་རེ་ཤིག་དཔའ་བོའི་ཚོང་གིས་དོག་པ་སྲང་གཅིག་གམ་སྲང་ཕྱེད་ཀྱིས་ཉོས་ལ་ཆུར་ཁྲུ་གང་། ཞེང་དུ་ཁྲུ་ཕྱེད་ཙམ་གྱི་རས་ཁ་ཚར་དང་བཅས་པ་ཐག་པ་ལ་འཐག་ཏུ་གཞུག་གོ། །
en: “First, one should purchase thread with due care, one pala or half a pala in weight, and commission a weaver to make a cloth one cubit long and half a cubit across, together with a fringe.

source: ཡང་ན་སྐྲ་མེད་པའི་རས་ཀྱི་དུམ་བུ་སར་པ་གཞན་སྟེང་དང་འོག་ཏུ་ཅི་ལྟར་འདོད་པ་ཁྲུ་གཉིས་དང་བཞི་དང་དྲུག་དང་ལྔ་དང་བཅུ་དང་བརྒྱད་པའི་རས་བླངས་ཏེ
en: Alternatively, one should obtain a different, new piece of cloth that is free from hairs, measuring—as one prefers—two, four, six, five, ten, or eight cubits from top to bottom, and very white,

source: ཅི་ལྟར་འདོད་པའི་རི་མོ་བས་རི་མོ་བྲི་བར་བྱའོ། །
en: and one should have the painter do the painting according to one’s wish. {7.10}

source: ཚོན་མ་འདྲེས་པ་དང་ཙནྡན་དང་ག་པུར་དང་། གུར་གུམ་གྱིས་བསྒོས་ཏེ།
en: “It should be painted using uncontaminated paints infused with sandalwood, camphor, and saffron.

source: རས་ཀྱང་ཙནྡན་དང་ག་པུར་དང་། གུར་གུམ་གཅིག་ཏུ་བྱས་པ་སྲོག་ཆགས་མེད་པའི་ཆུ་རྡུལ་མེད་པ་དང་བསྲེས་ཏེ།
en: First one should mix together sandalwood, camphor, and saffron into a homogenous substance and blend this with water free of living organisms and impurities.

source: སྣོད་སར་པའི་ནང་དུ་བཀྲུས་ལ་ཞག་གསུམ་གྱི་བར་དུ་ལེགས་པར་བཀབ་སྟེ།
en: One should soak the cloth in a vessel with this mixture, cover it well with a lid, and leave it for three days.

source: བཞག་ནས་གཙང་བའི་ཕྱོགས་སུ་སྲུང་བ་བྱས་ཤིང་བདག་ཉིད་ཀྱང་གཙང་བར་བྱས་ཏེ། ཟླ་བ་ཡར་ངོའི་ཚེས་བཅྭ་ལྔ་ལ་རས་སྣོད་ཀྱི་མདུན་དུ་ཤར་དུ་མངོན་པར་ཕྱོགས་ཏེ། ཀུ་ཤའི་ཁྲེས་ལ་འདུག་ནས། སྔགས་ཀྱི་ཚིག་ལན་བརྒྱ་རྩ་བརྒྱད་བརྗོད་པར་བྱ་བ་ལ་འདི་ལྟ་སྟེ།
en: Then, having performed the protection rite, in a clean place, having ritually purified oneself, during the bright fortnight, on the full moon day, one should sit on a bundle of kuśa grass in front of the vessel with the cloth in it and, facing the east, recite the words of the following mantra one hundred and eight times: {7.11}

source: ཨོཾ་ཧེ་ཧེ་བྷ་ག་བཱན་བ་ཧུ་རཱུ་བ་དྷཱ་ར་དི་བྱ་ཙཀྵུ་ཥེ། ཨ་བ་ལོ་ཀ་ཡ། ཨ་བ་ལོ་ཀ་ཡ། མཱཾ་ས་མ་ཡ་མ་ནུ་སྨ་ར་ཀུ་མཱ་ར་རཱུ་པ་དྷཱ་རི་ཎེ། མ་ཧཱ་བོ་དྷི་ས་ཏྭ་ཀིཉྩི་རཱ་ཡ་སི་ཧཱུཾ་སྥ་ཊེ་སྥ་ཊེ་སྭཱ་ཧཱ།
en: “ Oṁ he he ! O blessed one with many forms and the divine eye, look after me, look! Remember your samaya! O great bodhisattva with the form of a divine youth, why do you delay? Hūṁ hūṁ phaṭ phaṭ svāhā! {7.12}

source: སྔགས་འདི་བཟླས་པ་བྱས་ལ་དེ་ཉིད་དུ་ཉལ་བར་བྱའོ། །
en: “Having recited this mantra, one should go to sleep right then.

source: གཉིད་ལོག་པའི་རྨི་ལམ་དུ་འགྲུབ་པ་འམ་མི་འགྲུབ་པ་སྟོན་པར་འགྱུར་རོ། །
en: While asleep, one will receive a sign whether the procedure will be successful or not.
